---
kind: property
id: P:Autodesk.Revit.DB.ScheduleSortGroupField.FieldId
source: html/3ba02d83-443a-2e7f-fa12-6ce9f30e531a.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.FieldId Property

The ID of the field that the schedule will be sorted or grouped by.

## Syntax (C#)
```csharp
public ScheduleFieldId FieldId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null